In [1]:
%load_ext sql

In [2]:
%sql sqlite:///nueva.sqlite

In [3]:
%%sql

CREATE TABLE alumnos (id INTEGER NOT NULL, 
                      nombre VARCHAR(50) NOT NULL, 
                      clase VARCHAR(30) DEFAULT "SQL",
                      fecha_de_ingreso DATE NOT NULL,
                      puntaje_A INTEGER,
                      puntaje_B INTEGER);

 * sqlite:///nueva.sqlite
Done.

[]

In [4]:
%%sql 

INSERT INTO alumnos 
(id, nombre, fecha_de_ingreso, puntaje_A, puntaje_B)
VALUES
(1, "Xavier", "2023-02-04", 3, 3),
(2, "Ana", "2023-01-15", 8, 9),
(3, "Rodrigo", "2023-02-02", 7, 9),
(4, "Susana", "2023-01-01", 4, 9),
(5, "Jose", "2023-02-01", 5, 5),
(6, "Luis", "2023-02-01", 7, 10),
(7, "Omar", "2023-02-01", 2, 8);

 * sqlite:///nueva.sqlite
7 rows affected.

[]

In [5]:
%sql SELECT * FROM alumnos;

 * sqlite:///nueva.sqlite
Done.

[(1, 'Xavier', 'SQL', '2023-02-04', 3, 3),
 (2, 'Ana', 'SQL', '2023-01-15', 8, 9),
 (3, 'Rodrigo', 'SQL', '2023-02-02', 7, 9),
 (4, 'Susana', 'SQL', '2023-01-01', 4, 9),
 (5, 'Jose', 'SQL', '2023-02-01', 5, 5),
 (6, 'Luis', 'SQL', '2023-02-01', 7, 10),
 (7, 'Omar', 'SQL', '2023-02-01', 2, 8)]

In [6]:
%sql SELECT 5 + 5;

 * sqlite:///nueva.sqlite
Done.

[(10,)]

In [7]:
%sql SELECT 5 - 5;

 * sqlite:///nueva.sqlite
Done.

[(0,)]

In [8]:
%sql SELECT 5 * 5;

 * sqlite:///nueva.sqlite
Done.

[(25,)]

In [9]:
%sql SELECT 5 / 5;

 * sqlite:///nueva.sqlite
Done.

[(1,)]

In [10]:
%sql SELECT 7 % 5;

 * sqlite:///nueva.sqlite
Done.

[(2,)]

In [11]:
%sql SELECT nombre, clase, (puntaje_A + puntaje_B) / 2 AS puntaje_final FROM alumnos;

 * sqlite:///nueva.sqlite
Done.

[('Xavier', 'SQL', 3),
 ('Ana', 'SQL', 8),
 ('Rodrigo', 'SQL', 8),
 ('Susana', 'SQL', 6),
 ('Jose', 'SQL', 5),
 ('Luis', 'SQL', 8),
 ('Omar', 'SQL', 5)]

In [12]:
%sql SELECT puntaje_A + puntaje_B FROM alumnos;

 * sqlite:///nueva.sqlite
Done.

[(6,), (17,), (16,), (13,), (10,), (17,), (10,)]

In [13]:
%sql SELECT puntaje_A - puntaje_B FROM alumnos;

 * sqlite:///nueva.sqlite
Done.

[(0,), (-1,), (-2,), (-5,), (0,), (-3,), (-6,)]

In [14]:
%sql SELECT puntaje_B * 2 FROM alumnos;

 * sqlite:///nueva.sqlite
Done.

[(6,), (18,), (18,), (18,), (10,), (20,), (16,)]

In [15]:
%sql SELECT puntaje_B / 2 FROM alumnos;

 * sqlite:///nueva.sqlite
Done.

[(1,), (4,), (4,), (4,), (2,), (5,), (4,)]

In [38]:
%sql SELECT puntaje_B > 5 FROM alumnos;

 * sqlite:///nueva.sqlite
Done.

[(0,), (1,), (1,), (1,), (0,), (1,), (1,)]

In [17]:
%sql SELECT * FROM alumnos WHERE puntaje_B != 5;

 * sqlite:///nueva.sqlite
Done.

[(1, 'Xavier', 'SQL', '2023-02-04', 3, 3),
 (2, 'Ana', 'SQL', '2023-01-15', 8, 9),
 (3, 'Rodrigo', 'SQL', '2023-02-02', 7, 9),
 (4, 'Susana', 'SQL', '2023-01-01', 4, 9),
 (6, 'Luis', 'SQL', '2023-02-01', 7, 10),
 (7, 'Omar', 'SQL', '2023-02-01', 2, 8)]

In [18]:
%sql SELECT * FROM alumnos WHERE puntaje_A <> 4;

 * sqlite:///nueva.sqlite
Done.

[(1, 'Xavier', 'SQL', '2023-02-04', 3, 3),
 (2, 'Ana', 'SQL', '2023-01-15', 8, 9),
 (3, 'Rodrigo', 'SQL', '2023-02-02', 7, 9),
 (5, 'Jose', 'SQL', '2023-02-01', 5, 5),
 (6, 'Luis', 'SQL', '2023-02-01', 7, 10),
 (7, 'Omar', 'SQL', '2023-02-01', 2, 8)]

In [19]:
%%sql 
SELECT *
FROM alumnos
ORDER BY nombre ASC;

 * sqlite:///nueva.sqlite
Done.

[(2, 'Ana', 'SQL', '2023-01-15', 8, 9),
 (5, 'Jose', 'SQL', '2023-02-01', 5, 5),
 (6, 'Luis', 'SQL', '2023-02-01', 7, 10),
 (7, 'Omar', 'SQL', '2023-02-01', 2, 8),
 (3, 'Rodrigo', 'SQL', '2023-02-02', 7, 9),
 (4, 'Susana', 'SQL', '2023-01-01', 4, 9),
 (1, 'Xavier', 'SQL', '2023-02-04', 3, 3)]

In [20]:
%%sql 
SELECT *, (puntaje_A + puntaje_B) / 2 AS promedio
FROM alumnos
ORDER BY promedio DESC;

 * sqlite:///nueva.sqlite
Done.

[(2, 'Ana', 'SQL', '2023-01-15', 8, 9, 8),
 (3, 'Rodrigo', 'SQL', '2023-02-02', 7, 9, 8),
 (6, 'Luis', 'SQL', '2023-02-01', 7, 10, 8),
 (4, 'Susana', 'SQL', '2023-01-01', 4, 9, 6),
 (5, 'Jose', 'SQL', '2023-02-01', 5, 5, 5),
 (7, 'Omar', 'SQL', '2023-02-01', 2, 8, 5),
 (1, 'Xavier', 'SQL', '2023-02-04', 3, 3, 3)]

In [21]:
%%sql 
SELECT *
FROM alumnos
WHERE puntaje_B >= 8;

 * sqlite:///nueva.sqlite
Done.

[(2, 'Ana', 'SQL', '2023-01-15', 8, 9),
 (3, 'Rodrigo', 'SQL', '2023-02-02', 7, 9),
 (4, 'Susana', 'SQL', '2023-01-01', 4, 9),
 (6, 'Luis', 'SQL', '2023-02-01', 7, 10),
 (7, 'Omar', 'SQL', '2023-02-01', 2, 8)]

In [22]:
%%sql 
SELECT *
FROM alumnos
WHERE fecha_de_ingreso BETWEEN "2023-01-01" AND "2023-01-31";

 * sqlite:///nueva.sqlite
Done.

[(2, 'Ana', 'SQL', '2023-01-15', 8, 9),
 (4, 'Susana', 'SQL', '2023-01-01', 4, 9)]

In [23]:
%%sql 
SELECT *, (puntaje_A + puntaje_B) / 2 AS promedio
FROM alumnos
WHERE promedio BETWEEN 3 AND 7;

 * sqlite:///nueva.sqlite
Done.

[(1, 'Xavier', 'SQL', '2023-02-04', 3, 3, 3),
 (4, 'Susana', 'SQL', '2023-01-01', 4, 9, 6),
 (5, 'Jose', 'SQL', '2023-02-01', 5, 5, 5),
 (7, 'Omar', 'SQL', '2023-02-01', 2, 8, 5)]

In [39]:
%%sql 
SELECT *
FROM alumnos
WHERE nombre LIKE "%a";

 * sqlite:///nueva.sqlite
Done.

[(2, 'Ana', 'SQL', '2023-01-15', 8, 9),
 (4, 'Susana', 'SQL', '2023-01-01', 4, 9)]

In [40]:
%%sql 
SELECT *
FROM alumnos
WHERE puntaje_B IN (8, 9, 10);

 * sqlite:///nueva.sqlite
Done.

[(2, 'Ana', 'SQL', '2023-01-15', 8, 9),
 (3, 'Rodrigo', 'SQL', '2023-02-02', 7, 9),
 (4, 'Susana', 'SQL', '2023-01-01', 4, 9),
 (6, 'Luis', 'SQL', '2023-02-01', 7, 10),
 (7, 'Omar', 'SQL', '2023-02-01', 2, 8)]

In [26]:
%%sql
SELECT DISTINCT puntaje_B
FROM alumnos;

 * sqlite:///nueva.sqlite
Done.

[(3,), (9,), (5,), (10,), (8,)]

In [27]:
%%sql
SELECT DISTINCT clase, fecha_de_ingreso
FROM alumnos;

 * sqlite:///nueva.sqlite
Done.

[('SQL', '2023-02-04'),
 ('SQL', '2023-01-15'),
 ('SQL', '2023-02-02'),
 ('SQL', '2023-01-01'),
 ('SQL', '2023-02-01')]

In [28]:
%%sql
SELECT COUNT(DISTINCT fecha_de_ingreso)
FROM alumnos;

 * sqlite:///nueva.sqlite
Done.

[(5,)]

In [29]:
#%sql DROP TABLE alumnos;